# 영화감독 숌 

def main():
    NUMBER_OF_THE_END = "666"

    N = int(input())

    """
    666
    1666 2666 3666 4666 5666 6660 6661 6662 6663 6664 6665 6666 6667 6668 6669 7666 8666 9666
    10666 11666 12666 13666 14666 15666 16660 16661 16662 16663 16664 16665 16666 16667 16668 16669 17666 18666 19666 
    20666, 21666, ..., 28666, 29666, 
    100666, 101666 102666
    => 5자리 넘어가면 또 다른 패턴이 나옴
    => 규칙을 적용하기 어려움 
    => 진짜 브루트포스?
    """
    n = 1
    cnt = 0
    while True:
        if NUMBER_OF_THE_END in str(n):
            cnt += 1
        if cnt == N:
            print(n)
            break 
        n += 1    

if __name__=='__main__':
    main()